final List<Map<String, String>> masseges = [
  {
    "name": "صالح عبدالعزيز",
    "massege": "متى ممكن استلم الشقة؟ أي وقت وأي يوم بالضبط...",
    "avatar": "ص",
    "time": "٣:٠٠ م",
  },
  {
    "name": "أحمد محمد",
    "massege": "تم تحويل الدفعة، متى يتم التوثيق على منصة إيجار؟",
    "avatar": "أ",
    "time": "٤:١٥ م",
  },
  {
    "name": "نورة العتيبي",
    "massege": "هل ممكن أزور المكتب بكرة الصبح؟",
    "avatar": "ن",
    "time": "٩:٤٥ ص",
  },
  {
    "name": "عبدالله الحربي",
    "massege": "الرجاء إرسال نسخة من العقد على بريدي.",
    "avatar": "ع",
    "time": "١٢:٣٠ م",
  },
  {
    "name": "ليان صالح",
    "massege": "متى يتم تفعيل الكهرباء في الشقة الجديدة؟",
    "avatar": "ل",
    "time": "٧:٥٥ م",
  },
  {
    "name": "محمد العبدالله",
    "massege": "احتاج جدول بالدفعات القادمة بشكل واضح.",
    "avatar": "م",
    "time": "٢:٢٠ م",
  },
  {
    "name": "ريم العتيق",
    "massege": "شكراً لتعاونكم 🌹 الخدمة كانت ممتازة.",
    "avatar": "ر",
    "time": "٥:٤٠ م",
  },
  {
    "name": "فهد الغامدي",
    "massege": "واجهت مشكلة في تسجيل الدخول، ممكن مساعدة؟",
    "avatar": "ف",
    "time": "١٠:٠٠ ص",
  },
  {
    "name": "هناء الشريف",
    "massege": "هل عندكم عروض على الشقق المفروشة؟",
    "avatar": "هـ",
    "time": "٨:١٥ م",
  },
  {
    "name": "طارق السبيعي",
    "massege": "هل الاستلام يشمل المواقف والسيارات أيضاً؟",
    "avatar": "ط",
    "time": "٦:٥٠ م",
  },
];